wisteria-1c/Конфигурация/Catalogs/СостоянияЗаказовПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СостоянияЗаказовПоставщикам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Comment>АПК:58 - проектное решение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьСтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЦветСтарый</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ДатыЗапретаИзменения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДатыЗапретаИзменения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеДатыЗапрета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.РазделыДатЗапретаИзменения</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АдресатЗапретаИзменения</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВариантыЗавершенияЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыЗавершенияЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Успешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ЗадачиАссистентаУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЗадачиАссистентаУправления</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВспомогательноеЗначение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодульМенеджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиАссистентаУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательДляОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОповещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОповещенияАссистентаУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>События</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СобытиеИдентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантЗаполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыУсловия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидСравненияЗначений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПредставление</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ПроцессыСостоянийЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПроцессыСостоянийЗаказов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗаказНарядов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбработкаПроверкиЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказовПоставщикам</v8:Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказНарядов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантЗавершения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыЗавершенияЗаказа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбработкаПроведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказовПоставщикам</v8:Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказНарядов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантЗавершения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыЗавершенияЗаказа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/СостоянияЗаказовПоставщикам/Forms/ФормаСпискаПроцессов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеСостоянияЗавершен(
	СписокСостояний.КомпоновщикНастроек.Настройки.УсловноеОформление, ПредопределенноеЗначение(
	"Справочник.СостоянияЗаказовПоставщикам.Завершен"));
	
	ИспользоватьПроцессы = ПолучитьФункциональнуюОпцию("ИспользоватьПроцессыСостояний");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
	"СтраницаПроцессы", 
	"Видимость", 
	ИспользоватьПроцессы);
	
	УстановитьУсловноеОформлениеПоЦветамСостоянийСервер();
	
	СписокСостояний.Порядок.Элементы.Очистить();
	
	Если Параметры.Свойство("НастройкаПроцессов") Тогда
		Элементы.СтраницыСостояний.ТекущаяСтраница = Элементы.СтраницаПроцессы;
	КонецЕсли;
	
	Порядок = СписокСостояний.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	Порядок.Использование = Истина;
	Порядок.Поле = Новый ПолеКомпоновкиДанных("РеквизитДопУпорядочивания");
	Порядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
	Порядок = СписокСостояний.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	Порядок.Использование = Истина;
	Порядок.Поле = Новый ПолеКомпоновкиДанных("ЗавершенПоследним");
	Порядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
	// Установим настройки формы для случая открытия в режиме выбора
	РежимВыбора = Неопределено;
	Параметры.Свойство("РежимВыбора", РежимВыбора);
	Если РежимВыбора = Неопределено Тогда
		РежимВыбора = Ложь;
	КонецЕсли;
	
	Элементы.Список.РежимВыбора = РежимВыбора;
	Элементы.Список.МножественныйВыбор = ?(Параметры.ЗакрыватьПриВыборе = Неопределено, Ложь, Не Параметры.ЗакрыватьПриВыборе);
	Если РежимВыбора Тогда
		КлючНазначенияИспользования = КлючНазначенияИспользования + "ВыборПодбор";
		РежимБлокировкиПриОткрытииОкна = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	Иначе
		КлючНазначенияИспользования = КлючНазначенияИспользования + "Список";
	КонецЕсли;
	
	ОбновитьПроцессы();
	
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	Массив = Новый Массив;
	Массив.Добавить(Метаданные.Справочники.СостоянияЗаказовПоставщикам);
	ПараметрыРазмещения.Вставить("Источники", Массив);
	ПараметрыРазмещения.Вставить("КоманднаяПанель", Элементы.Список.КоманднаяПанель);
	ПараметрыРазмещения.Вставить("ПрефиксГрупп", "Список");
	ПараметрыРазмещения.Вставить("ВладелецКоманд", Элементы.Список);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	АдаптацияМобильныйКлиент();
	
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_СостоянияЗаказовПоставщикам" Тогда
		ОбработкаОповещенияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбработатьОтветНаВопрос", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
	ПоказатьВопрос(ОписаниеОповещенияОЗакрытии, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаКоманд = Элементы.Найти("НастройкаПорядкаЭлементов");
	Если ГруппаКоманд <> Неопределено Тогда
		ГруппаКоманд.Доступность = 
		(Элементы.Список.ТекущаяСтрока <> ПредопределенноеЗначение("Справочник.СостоянияЗаказовПоставщикам.Завершен"));
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНаведении(Элемент, Строка, Поле)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	СписокПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПроцессы

&НаКлиенте
Процедура ПроцессыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент <> Элементы.ПроцессыНастройкаАссистента Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Процессы.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗадачи", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторГруппы", ДанныеСтроки.ИдентификаторГруппыАссистента);
	ОткрытьФорму(ДанныеСтроки.ИмяФормыЗадачиАссистента, ПараметрыФормы, , , , , ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцессыПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущаяСтрока = Элемент.ТекущаяСтрока;
	Если ТекущиеДанные = Неопределено Или ТекущаяКолонка = Неопределено Или ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЭлемента = ТекущаяКолонка.Имя;
	Если Не СтрНачинаетсяС(ИмяЭлемента, "ПроцессыИспользуетсяДляСостояния_") Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтроки = Сред(ИмяЭлемента, СтрДлина("ПроцессыИспользуетсяДляСостояния_") + 1);
	Если ИмяЭлемента = Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенУспешно.Имя Тогда
		ЗначениеФлага = ТекущиеДанные.ИспользуетсяДляСостояния_ЗавершенУспешно;
	ИначеЕсли ИмяЭлемента = Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенОтменен.Имя Тогда
		ЗначениеФлага = ТекущиеДанные.ИспользуетсяДляСостояния_ЗавершенОтменен;
	Иначе
		ЗначениеФлага = ТекущиеДанные[ИмяРеквизитаКолонкиСостояния(, ИдентификаторСтроки, ЭтотОбъект)];
	КонецЕсли;
	
	Если ТекущиеДанные.ТипНастройки = "ОбязательноЗаполнятьПолеПричинаОтменыТовара" Тогда
		
		ОбработатьИзменениеФлагаОбязательноЗаполнитьПричинуОтмены(ИмяЭлемента, ТекущаяСтрока, ЗначениеФлага);
		
	ИначеЕсли ТекущиеДанные.ТипНастройки = "ХранитьИсториюИзменений" Тогда
		
		ОбработатьИзменениеФлагаИсторияИзменений(ТекущиеДанные, ЗначениеФлага);
		
	ИначеЕсли ТекущиеДанные.ТипНастройки = "ЗапрещатьИзменениеДанныхПрошлыхПериодов" Тогда
		
		ОбработатьИзменениеФлагаДатыЗапретаИзменений(ИмяЭлемента, ТекущиеДанные);
		
	ИначеЕсли ТекущиеДанные.ТипНастройки = "ЗапрещатьЗавершениеНеотгруженныхЗаказов" Тогда
		
		ОбработатьИзменениеФлагаЗапретЗавершения();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	
	Модифицированность = Ложь;
	СохранитьДанныеПроцессов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Модифицированность = Ложь;
	СохранитьДанныеПроцессов();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СписокСостояний

&НаСервере
Процедура СписокПриИзмененииНаСервере()
	
	ОбновитьПроцессы();
	УстановитьУсловноеОформлениеПоЦветамСостоянийСервер();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеПоЦветамСостоянийСервер()
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеПоЦветамСостояний(
	СписокСостояний.КомпоновщикНастроек.Настройки.УсловноеОформление,
	Метаданные.Справочники.СостоянияЗаказовПоставщикам.ПолноеИмя(),
	"Ссылка",
	"Ссылка");
	
КонецПроцедуры

#КонецОбласти

#Область Процессы

#Область ОбновлениеПроцессов

&НаСервере
Процедура ОбновитьПроцессы()
	
	ЗаполнитьПорядокСостояний();
	
	ОбновитьРеквизитыСостоянийПроцессов();
	ОбновитьЭлементыСостоянийПроцессов();
	ЗаполнитьСтатическийКонтентПроцессов();
	УстановитьУсловноеОформлениеНаПроцессы();
	УстановитьФлагиПроцессов();
	
	Элементы.Процессы.ТекущаяСтрока = Процессы[1].ПолучитьИдентификатор();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПорядокСостояний()
	
	ПорядокСостояний.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СправочникСостоянияЗаказовПоставщикам.Ссылка КАК Состояние,
	|	СправочникСостоянияЗаказовПоставщикам.РеквизитДопУпорядочивания КАК НомерСтроки,
	|	СправочникСостоянияЗаказовПоставщикам.Наименование КАК НаименованиеСостояния
	|ИЗ
	|	Справочник.СостоянияЗаказовПоставщикам КАК СправочникСостоянияЗаказовПоставщикам
	|
	|УПОРЯДОЧИТЬ ПО
	|	СправочникСостоянияЗаказовПоставщикам.РеквизитДопУпорядочивания";
	
	ПорядокСостояний.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыСостоянийПроцессов()
	
	ПоляТаблицы = ПолучитьРеквизиты("Процессы");
	
	ПутиУдаляемыхРеквизитов = Новый Массив;
	Для Каждого ПолеТаблицы Из ПоляТаблицы Цикл
		
		Имя = ПолеТаблицы.Имя;
		
		Если Имя <> "ЗаголовокНастройки"
			И Имя <> "ЭтоГруппа"
			И Имя <> "ИспользуетсяДляСостояния_ЗавершенУспешно"
			И Имя <> "ИспользуетсяДляСостояния_ЗавершенОтменен"
			И Имя <> "ТипНастройки"
			И Имя <> "НастройкаАссистента"
			И Имя <> "ИдентификаторГруппыАссистента"
			И Имя <> "ИмяФормыЗадачиАссистента" Тогда
			
			ПутиУдаляемыхРеквизитов.Добавить(СтрШаблон("%1.%2", ПолеТаблицы.Путь, Имя));
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого ДанныеСостояния Из ПорядокСостояний Цикл
		
		Если ДанныеСостояния.Состояние = Справочники.СостоянияЗаказовПоставщикам.Завершен Тогда
			Продолжить;
		КонецЕсли;
		
		НовоеПоле = Новый РеквизитФормы(
		"ИспользуетсяДляСостояния_" + ДанныеСостояния.НомерСтроки,
		Новый ОписаниеТипов("Булево"),
		"Процессы",
		ДанныеСостояния.НаименованиеСостояния);
		
		ДобавляемыеРеквизиты.Добавить(НовоеПоле);
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты, ПутиУдаляемыхРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыСостоянийПроцессов()
	
	ЭлементыНаУдаление = Новый Массив;
	Для Каждого КолонкаТаблицы Из Элементы.Процессы.ПодчиненныеЭлементы Цикл
		
		Имя = КолонкаТаблицы.Имя;
		
		Если Имя <> Элементы.ГруппаЗаголовков.Имя
			И Имя <> Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенУспешно.Имя
			И Имя <> Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенОтменен.Имя Тогда
			
			ЭлементыНаУдаление.Добавить(КолонкаТаблицы);
			
		КонецЕсли;
		
	КонецЦикла;
	Для Каждого КолонкаТаблицы Из ЭлементыНаУдаление Цикл
		Элементы.Удалить(КолонкаТаблицы);
	КонецЦикла;
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого ДанныеСостояния Из ПорядокСостояний Цикл
		
		Если ДанныеСостояния.Состояние = Справочники.СостоянияЗаказовПоставщикам.Завершен Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКДанным = "ИспользуетсяДляСостояния_" + ДанныеСостояния.НомерСтроки;
		
		КолонкаТаблицы = Элементы.Добавить("Процессы" + ПутьКДанным, Тип("ПолеФормы"), Элементы.Процессы);
		КолонкаТаблицы.Вид = ВидПоляФормы.ПолеФлажка;
		КолонкаТаблицы.ПутьКДанным = СтрШаблон("Процессы.%1", ПутьКДанным);
		
		Элементы.Переместить(КолонкаТаблицы, Элементы.Процессы, Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенУспешно);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатическийКонтентПроцессов()
	
	Процессы.Очистить();
	
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ЭтоГруппа = Истина;
	СтрокаТЗ.ТипНастройки = "КорректировкаЗаказа";
	СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Корректировка заказа'");
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ТипНастройки = "ОбязательноЗаполнятьПолеПричинаОтменыТовара";
	СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Обязательно заполнять поле ""Причина отмены товара""'");
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ТипНастройки = "ЗапрещатьЗавершениеНеотгруженныхЗаказов";
	СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Запрещать завершение непоставленных заказов'");
	
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ЭтоГруппа = Истина;
	СтрокаТЗ.ТипНастройки = "ОбщиеНастройкиДляВсехВидовЗаказа";
	СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Общие настройки'");
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ТипНастройки = "ЗапрещатьИзменениеДанныхПрошлыхПериодов";
	СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Запрещать изменение данных прошлых периодов'");
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ТипНастройки = "ХранитьИсториюИзменений";
	СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Хранить историю изменений'");
	
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ЭтоГруппа = Истина;
	СтрокаТЗ.ТипНастройки = "ДашаИзмениСостояниеЗаказов";
	СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Даша, измени состояние связанных заказов'");
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ТипНастройки = "ДашаИзмениСостояниеЗаказаПокупателя";
	СтрокаТЗ.НастройкаАссистента = НСтр("ru = 'Измени состояние заказа покупателя'");
	СтрокаТЗ.ИмяФормыЗадачиАссистента = "Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов";
	СтрокаТЗ.ИдентификаторГруппыАссистента = "ИзменениеСостоянияЗаказаПокупателяПоСостояниюЗаказовПоставщикам";
	
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ЭтоГруппа = Истина;
	СтрокаТЗ.ТипНастройки = "ДашаПереведиЗаказВСостояние";
	СтрокаТЗ.ЗаголовокНастройки = НСтр("ru = 'Даша, переведи заказ в состояние'");
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ТипНастройки = "ДашаПриИзмененииСтатусаОплаты";
	СтрокаТЗ.НастройкаАссистента = НСтр("ru = 'При изменении статуса оплаты'");
	СтрокаТЗ.ИмяФормыЗадачиАссистента = "Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПриОплатеИПоставке";
	СтрокаТЗ.ИдентификаторГруппыАссистента = "ИзменениеСостоянияЗаказаПоставщикуПриОплате";
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ТипНастройки = "ДашаПриИзмененииСтатусаПоставки";
	СтрокаТЗ.НастройкаАссистента = НСтр("ru = 'При изменении статуса поставки'");
	СтрокаТЗ.ИмяФормыЗадачиАссистента = "Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПриОплатеИПоставке";
	СтрокаТЗ.ИдентификаторГруппыАссистента = "ИзменениеСостоянияЗаказаПоставщикуПриПоставке";
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ТипНастройки = "ДашаПриИзмененииСтатусаОплатыИПоставки";
	СтрокаТЗ.НастройкаАссистента = НСтр("ru = 'При изменении статуса оплаты и поставки'");
	СтрокаТЗ.ИмяФормыЗадачиАссистента = "Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПриОплатеИПоставке";
	СтрокаТЗ.ИдентификаторГруппыАссистента = "ИзменениеСостоянияЗаказаПоставщикуПриОплатеИПоставке";
	СтрокаТЗ = Процессы.Добавить();
	СтрокаТЗ.ТипНастройки = "ДашаПриИзмененииСостоянияЗаказаПокупателя";
	СтрокаТЗ.НастройкаАссистента = НСтр("ru = 'При изменении состояния заказа покупателя'");
	СтрокаТЗ.ИмяФормыЗадачиАссистента = "Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПоСостояниюСвязанныхЗаказов";
	СтрокаТЗ.ИдентификаторГруппыАссистента = "ИзменениеСостоянияЗаказаПоставщикуПоСостояниюЗаказовПокупателей";
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеНаПроцессы()
	
	УстановитьУсловноеОформлениеГруппПроцессов();
	УстановитьУсловноеОформлениеНастроекАссистента();
	УстановитьУсловноеОформлениеКорректировкиЗаказов();
	УстановитьУсловноеОбщихНастроекЗаказов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеГруппПроцессов()
	
	Если ЭтоИнтерфейсТакси Тогда
		ШрифтГруппы = Новый Шрифт(,,Истина);
	Иначе
		ШрифтГруппы = ШрифтыСтиля.ЗаголовокТретьегоУровня;
	КонецЕсли;
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "Процессы.ЭтоГруппа", Истина, ВидСравненияКомпоновкиДанных.Равно);
	ОформляемыеПоля = Новый Массив;
	Для Каждого ПолеТаблицы Из Элементы.Процессы.ПодчиненныеЭлементы Цикл
		ОформляемыеПоля.Добавить(ПолеТаблицы.Имя);
	КонецЦикла;
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Видимость", Ложь);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "Процессы.ЭтоГруппа", Истина, ВидСравненияКомпоновкиДанных.Равно);
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить(Элементы.ПроцессыЗаголовокНастройки.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Шрифт", ШрифтГруппы);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветФона", ЦветаПалитры.Серый);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Доступность", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеНастроекАссистента()
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "Процессы.НастройкаАссистента", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить(Элементы.ПроцессыНастройкаАссистента.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Видимость", Ложь);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "Процессы.НастройкаАссистента", , ВидСравненияКомпоновкиДанных.Заполнено);
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить(Элементы.ПроцессыЗаголовокНастройки.Имя);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Видимость", Ложь);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "Процессы.НастройкаАссистента", , ВидСравненияКомпоновкиДанных.Заполнено);
	ОформляемыеПоля = Новый Массив;
	Для Каждого ПолеТаблицы Из Элементы.Процессы.ПодчиненныеЭлементы Цикл
		ОформляемыеПоля.Добавить(ПолеТаблицы.Имя);
	КонецЦикла;
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Доступность", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеКорректировкиЗаказов()
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "Процессы.ТипНастройки", "ЗапрещатьЗавершениеНеотгруженныхЗаказов", ВидСравненияКомпоновкиДанных.Равно);
	ОформляемыеПоля = Новый Массив;
	Для Каждого ПолеТаблицы Из Элементы.Процессы.ПодчиненныеЭлементы Цикл
		Если ПолеТаблицы.Имя <> Элементы.ПроцессыЗаголовокНастройки.Имя
			И ПолеТаблицы.Имя <> Элементы.ПроцессыНастройкаАссистента.Имя
			И ПолеТаблицы.Имя <> Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенУспешно.Имя
			И ПолеТаблицы.Имя <> Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенОтменен.Имя Тогда
			ОформляемыеПоля.Добавить(ПолеТаблицы.Имя);
		КонецЕсли;
	КонецЦикла;
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Доступность", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОбщихНастроекЗаказов()
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор, "Процессы.ТипНастройки", "ХранитьИсториюИзменений", ВидСравненияКомпоновкиДанных.Равно);
	ОформляемыеПоля = Новый Массив;
	ИндексПоля = 0;
	Для Каждого ПолеТаблицы Из Элементы.Процессы.ПодчиненныеЭлементы Цикл
		Если ПолеТаблицы.Имя <> Элементы.ПроцессыЗаголовокНастройки.Имя
			И ПолеТаблицы.Имя <> Элементы.ПроцессыНастройкаАссистента.Имя
			И ИндексПоля <> 1 Тогда
			ОформляемыеПоля.Добавить(ПолеТаблицы.Имя);
		КонецЕсли;
		ИндексПоля = ИндексПоля + 1;
	КонецЦикла;
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Доступность", Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеФлаговПроцессов

Процедура УстановитьФлагиПроцессов()
	
	Если НЕ ИспользоватьПроцессы Тогда
		Возврат;
	КонецЕсли;
	
	Если ПорядокСостояний.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьФлагиАссистентУправления();
	УстановитьФлагиВерсионирования();
	УстановитьФлагиДатыЗапретаИзменений();
	УстановитьФлагиОбязательноеЗаполнениеПричины();
	УстановитьФлагиЗапретЗавершения();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиАссистентУправления(ИдентификаторГруппы = Неопределено)
	
	ОтборПоГруппе = Ложь;
	Если ИдентификаторГруппы = Неопределено Тогда
		ОтборПоГруппе = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗадачиАссистента.Ссылка КАК Ссылка,
	|	ЗадачиАссистента.Родитель.ИдентификаторГруппы КАК ИдентификаторГруппы,
	|	ЗадачиАссистента.Используется КАК Используется,
	|	ЗадачиАссистента.ТипПредмета КАК ТипПредмета
	|ПОМЕСТИТЬ ИспользуемыеЗадачиАссистента
	|ИЗ
	|	Справочник.ЗадачиАссистентаУправления КАК ЗадачиАссистента
	|ГДЕ
	|	(&ОтборПоГруппе
	|			ИЛИ ЗадачиАссистента.Родитель.ИдентификаторГруппы = &ИдентификаторГруппы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИспользуемыеЗадачиАссистента.ИдентификаторГруппы КАК ИдентификаторГруппы,
	|	ИспользуемыеЗадачиАссистента.Используется КАК Используется,
	|	ИспользуемыеЗадачиАссистента.ТипПредмета КАК ТипПредмета,
	|	ЗначениеЗаполнения.Ссылка КАК Ссылка,
	|	ЗначениеЗаполнения.Параметр КАК Параметр,
	|	ЗначениеЗаполнения.Значение КАК Значение
	|ИЗ
	|	ИспользуемыеЗадачиАссистента КАК ИспользуемыеЗадачиАссистента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗадачиАссистентаУправления.ЗначенияЗаполнения КАК ЗначениеЗаполнения
	|		ПО (ЗначениеЗаполнения.Ссылка = ИспользуемыеЗадачиАссистента.Ссылка)
	|ГДЕ
	|	(ЗначениеЗаполнения.Параметр = ""СостояниеЗаказа""
	|			ИЛИ ЗначениеЗаполнения.Параметр = ""СостояниеЗаказаПоставщику""
	|			ИЛИ ЗначениеЗаполнения.Параметр = ""ВариантЗавершения""
	|			ИЛИ ЗначениеЗаполнения.Параметр = ""ВариантЗавершенияЗаказаПоставщику"")
	|	И (ИспользуемыеЗадачиАссистента.ТипПредмета = ""ЗаказПоставщику""
	|			ИЛИ ИспользуемыеЗадачиАссистента.ТипПредмета = ""ЗаказПоставщикуЗаказНаПроизводство"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИспользуемыеЗадачиАссистента.ИдентификаторГруппы,
	|	ИспользуемыеЗадачиАссистента.Используется,
	|	ИспользуемыеЗадачиАссистента.ТипПредмета,
	|	ПараметрыУсловияЗадач.Ссылка,
	|	ПараметрыУсловияЗадач.Параметр,
	|	ПараметрыУсловияЗадач.Значение
	|ИЗ
	|	ИспользуемыеЗадачиАссистента КАК ИспользуемыеЗадачиАссистента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗадачиАссистентаУправления.ПараметрыУсловия КАК ПараметрыУсловияЗадач
	|		ПО (ПараметрыУсловияЗадач.Ссылка = ИспользуемыеЗадачиАссистента.Ссылка)
	|ГДЕ
	|	(ПараметрыУсловияЗадач.Параметр = ""СостояниеЗаказа""
	|			ИЛИ ПараметрыУсловияЗадач.Параметр = ""СостояниеЗаказаПоставщику""
	|			ИЛИ ПараметрыУсловияЗадач.Параметр = ""ВариантЗавершения""
	|			ИЛИ ПараметрыУсловияЗадач.Параметр = ""ВариантЗавершенияЗаказаПоставщику"")
	|	И (ИспользуемыеЗадачиАссистента.ТипПредмета = ""ЗаказПоставщику""
	|			ИЛИ ИспользуемыеЗадачиАссистента.ТипПредмета = ""ЗаказПоставщикуЗаказНаПроизводство"")";
	Запрос.УстановитьПараметр("ОтборПоГруппе", ОтборПоГруппе);
	Запрос.УстановитьПараметр("ИдентификаторГруппы", ИдентификаторГруппы);
	
	ТаблицаЗадач = Запрос.Выполнить().Выгрузить();
	ТаблицаЗадач.Колонки.Добавить("Состояние", Новый ОписаниеТипов("СправочникСсылка.СостоянияЗаказовПоставщикам, ПеречислениеСсылка.ВариантыЗавершенияЗаказа"));
	
	Для Каждого Строка Из ТаблицаЗадач Цикл
		
		СостояниеЗаказа = Строка.Значение.Получить();
		Строка.Состояние = СостояниеЗаказа;
		
		ДействияЗадачи = Процессы.НайтиСтроки(Новый Структура("ИдентификаторГруппыАссистента", Строка.ИдентификаторГруппы));
		Если ДействияЗадачи.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		УстановитьФлагиДействий(ДействияЗадачи, Ложь, ЭтотОбъект);
		
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаЗадач Цикл
		
		ДействияЗадачи = Процессы.НайтиСтроки(Новый Структура("ИдентификаторГруппыАссистента", Строка.ИдентификаторГруппы));
		Если ДействияЗадачи.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДействиеЗадачи = ДействияЗадачи[0];
		
		Если СтрНайти(Строка.Параметр, "СостояниеЗаказа") = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.Состояние = Справочники.СостоянияЗаказовПоставщикам.Завершен Тогда
			
			ВариантЗавершенияУспешно = ТаблицаЗадач.НайтиСтроки(Новый Структура("Ссылка, Состояние", Строка.Ссылка, Перечисления.ВариантыЗавершенияЗаказа.Успешно));
			ВариантЗавершенияОтменен = ТаблицаЗадач.НайтиСтроки(Новый Структура("Ссылка, Состояние", Строка.Ссылка, Перечисления.ВариантыЗавершенияЗаказа.Отменен));
			
			Если ВариантЗавершенияУспешно.Количество() = 0 И ВариантЗавершенияОтменен.Количество() = 0 Тогда
				ДействиеЗадачи.ИспользуетсяДляСостояния_ЗавершенУспешно = Строка.Используется;
				Продолжить;
			КонецЕсли;
			
			Если ВариантЗавершенияУспешно.Количество() <> 0 Тогда
				ДействиеЗадачи.ИспользуетсяДляСостояния_ЗавершенУспешно = Строка.Используется;
			КонецЕсли;
			
			Если ВариантЗавершенияОтменен.Количество() <> 0 Тогда
				ДействиеЗадачи.ИспользуетсяДляСостояния_ЗавершенОтменен = Строка.Используется;
			КонецЕсли;
			
		Иначе
			
			УстановитьФлагПоСостоянию(ДействиеЗадачи, Строка.Используется, Строка.Состояние, ЭтотОбъект);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиВерсионирования()
	
	Действие = ДействиеПоТипуНастройки("ХранитьИсториюИзменений", ЭтотОбъект);
	УстановитьФлагиДействий(Действие, Ложь, ЭтотОбъект);
	
	УстановитьПривилегированныйРежим(Истина);
	ИспользоватьВерсионированиеОбъектов = Константы.ИспользоватьВерсионированиеОбъектов.Получить();
	
	Если ИспользоватьВерсионированиеОбъектов Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиВерсионированияОбъектов.ТипОбъекта КАК ТипОбъекта,
		|	НастройкиВерсионированияОбъектов.Вариант КАК ВариантВерсионирования,
		|	НастройкиВерсионированияОбъектов.СрокХраненияВерсий КАК СрокХраненияВерсий
		|ИЗ
		|	РегистрСведений.НастройкиВерсионированияОбъектов КАК НастройкиВерсионированияОбъектов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
		|		ПО (ИдентификаторыОбъектовМетаданных.Ссылка = НастройкиВерсионированияОбъектов.ТипОбъекта)
		|ГДЕ
		|	ИдентификаторыОбъектовМетаданных.ПолноеИмя = ""Документ.ЗаказПоставщику""";
		
		Таблица = Запрос.Выполнить().Выгрузить();
		ИспользоватьВерсионированиеОбъектов = Таблица.Количество() <> 0
		И Таблица[0].ВариантВерсионирования <> Перечисления.ВариантыВерсионированияОбъектов.НеВерсионировать;
		
	КонецЕсли;
	
	Действие = ДействиеПоТипуНастройки("ХранитьИсториюИзменений", ЭтотОбъект);
	УстановитьФлагиДействий(Действие, ИспользоватьВерсионированиеОбъектов, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиДатыЗапретаИзменений()
	
	Действие = ДействиеПоТипуНастройки("ЗапрещатьИзменениеДанныхПрошлыхПериодов", ЭтотОбъект);
	УстановитьФлагиДействий(Действие, Ложь, ЭтотОбъект);
	
	УстановитьПривилегированныйРежим(Истина);
	ДатыЗапретаВключены = Константы.ИспользоватьДатыЗапретаИзменения.Получить();
	
	Если Не ДатыЗапретаВключены Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатыЗапретаИзменения.Раздел КАК Раздел,
	|	ДатыЗапретаИзменения.Объект КАК Объект,
	|	ДатыЗапретаИзменения.Пользователь КАК Пользователь,
	|	ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапрета,
	|	ДатыЗапретаИзменения.ОписаниеДатыЗапрета КАК ОписаниеДатыЗапрета,
	|	ДатыЗапретаИзменения.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Раздел.Наименование = ""Заказы поставщиков""";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ДанныеСостояния Из ПорядокСостояний Цикл
		ЕстьНастройкаСостояния = Таблица.НайтиСтроки(Новый Структура("Объект", ДанныеСостояния.Состояние)).Количество();
		УстановитьФлагПоДаннымСостояния(Действие, ЕстьНастройкаСостояния, ДанныеСостояния, ЭтотОбъект);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиОбязательноеЗаполнениеПричины()
	
	Действие = ДействиеПоТипуНастройки("ОбязательноЗаполнятьПолеПричинаОтменыТовара", ЭтотОбъект);
	УстановитьФлагиДействий(Действие, Ложь, ЭтотОбъект);
	
	ПроцессыВида = ПроцессыВида("ОбработкаПроверкиЗаполнения");
	Для Каждого ДанныеПроцесса Из ПроцессыВида Цикл
		
		Если ДанныеПроцесса.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Успешно Тогда
			Действие.ИспользуетсяДляСостояния_ЗавершенУспешно = Истина;
		ИначеЕсли ДанныеПроцесса.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Отменен Тогда
			Действие.ИспользуетсяДляСостояния_ЗавершенОтменен = Истина;
		Иначе
			
			Для Каждого ДанныеСостояния Из ПорядокСостояний Цикл
				Если ДанныеПроцесса.Состояние = ДанныеСостояния.Состояние Тогда
					УстановитьФлагПоДаннымСостояния(Действие, Истина, ДанныеСостояния, ЭтотОбъект);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиЗапретЗавершения()
	
	Действие = ДействиеПоТипуНастройки("ЗапрещатьЗавершениеНеотгруженныхЗаказов", ЭтотОбъект);
	УстановитьФлагиДействий(Действие, Ложь, ЭтотОбъект);
	
	ПроцессыВида = ПроцессыВида("ОбработкаПроведения");
	
	Отбор = Новый Структура("Состояние, ВариантЗавершения",
	Справочники.СостоянияЗаказовПоставщикам.Завершен, Перечисления.ВариантыЗавершенияЗаказа.Успешно);
	ЕстьНастройка = ПроцессыВида.НайтиСтроки(Отбор).Количество();
	Действие.ИспользуетсяДляСостояния_ЗавершенУспешно = ЕстьНастройка;
	
	Отбор = Новый Структура("Состояние, ВариантЗавершения",
	Справочники.СостоянияЗаказовПоставщикам.Завершен, Перечисления.ВариантыЗавершенияЗаказа.Отменен);
	ЕстьНастройка = ПроцессыВида.НайтиСтроки(Отбор).Количество();
	Действие.ИспользуетсяДляСостояния_ЗавершенОтменен = ЕстьНастройка;
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеФлаговПроцессов

&НаКлиенте
Процедура ОбработатьИзменениеФлагаОбязательноЗаполнитьПричинуОтмены(ИмяТекущейКолонки, ТекущаяСтрока, ЗначениеФлага)
	
	ИзмененыНастройкиОбязательностиЗаполнения = Истина;
	
	Если Не ЗначениеФлага Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьИзменениеФлагаОбязательноЗаполнитьПричинуОтменыНаСервере(ИмяТекущейКолонки, ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеФлагаОбязательноЗаполнитьПричинуОтменыНаСервере(ИмяТекущейКолонки, ТекущаяСтрока)
	
	Действие = Процессы.НайтиПоИдентификатору(ТекущаяСтрока);
	УстановитьВсеПоследующиеФлаги(Действие, Истина, ЭтотОбъект, ИмяТекущейКолонки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеФлагаИсторияИзменений(ТекущиеДанные, ЗначениеФлага)
	
	ИзмененыНастройкиВерсионирования = Истина;
	УстановитьФлагиДействий(ТекущиеДанные, ЗначениеФлага, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеФлагаДатыЗапретаИзменений(ИмяЭлемента, ТекущиеДанные)
	
	ИзмененыНастройкиДатыЗапретаИзменений = Истина;
	
	Если ИмяЭлемента = Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенУспешно.Имя Тогда
		ТекущиеДанные.ИспользуетсяДляСостояния_ЗавершенОтменен = ТекущиеДанные.ИспользуетсяДляСостояния_ЗавершенУспешно;
	ИначеЕсли ИмяЭлемента = Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенОтменен.Имя Тогда
		ТекущиеДанные.ИспользуетсяДляСостояния_ЗавершенУспешно = ТекущиеДанные.ИспользуетсяДляСостояния_ЗавершенОтменен;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеФлагаЗапретЗавершения()
	
	ИзмененыНастройкиЗапретаЗавершения = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеДанныхПроцессов

&НаСервере
Процедура СохранитьДанныеПроцессов()
	
	ЗаписатьНастройкиВерсионирования();
	ЗаписатьНастройкиДатыЗапрета();
	ЗаполнитьДанныеОбязательностиЗаполнения();
	ЗаполнитьДанныеЗапретаЗавершения();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиВерсионирования()
	
	Если НЕ ИзмененыНастройкиВерсионирования Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ИспользоватьВерсионированиеОбъектов = Константы.ИспользоватьВерсионированиеОбъектов.Получить();
	Если НЕ ИспользоватьВерсионированиеОбъектов Тогда
		Константы.ИспользоватьВерсионированиеОбъектов.Установить(Истина);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипОбъектаВерсионирования) Тогда
		ТипОбъектаВерсионирования = ТипОбъектаВерсионирования();
	КонецЕсли;
	
	Действие = ДействиеПоТипуНастройки("ХранитьИсториюИзменений", ЭтотОбъект);
	Если Действие.ИспользуетсяДляСостояния_ЗавершенУспешно Тогда
		ВариантВерсионирования = Перечисления.ВариантыВерсионированияОбъектов.ВерсионироватьПриПроведении;
	Иначе
		ВариантВерсионирования = Перечисления.ВариантыВерсионированияОбъектов.НеВерсионировать;
	КонецЕсли;
	
	ВерсионированиеОбъектов.ЗаписатьНастройкуВерсионированияПоОбъекту(
	ТипОбъектаВерсионирования, ВариантВерсионирования, Перечисления.СрокиХраненияВерсий.Бессрочно);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиДатыЗапрета()
	
	Если НЕ ИзмененыНастройкиДатыЗапретаИзменений Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ИспользоватьДатыЗапретаИзменения = Константы.ИспользоватьДатыЗапретаИзменения.Получить();
	Если НЕ ИспользоватьДатыЗапретаИзменения Тогда
		Константы.ИспользоватьДатыЗапретаИзменения.Установить(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатыЗапретаИзменения.Раздел КАК Раздел,
	|	ДатыЗапретаИзменения.Объект КАК Объект,
	|	ДатыЗапретаИзменения.Пользователь КАК Пользователь,
	|	ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапрета,
	|	ДатыЗапретаИзменения.ОписаниеДатыЗапрета КАК ОписаниеДатыЗапрета,
	|	ДатыЗапретаИзменения.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Раздел.Наименование = ""Заказы поставщиков""";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	РазделДатыЗапрета = РазделДатыЗапрета();
	Действие = ДействиеПоТипуНастройки("ЗапрещатьИзменениеДанныхПрошлыхПериодов", ЭтотОбъект);
	
	Для Каждого ДанныеСостояния Из ПорядокСостояний Цикл
		
		Отбор = Новый Структура("Объект, Пользователь, ДатаЗапрета",
		ДанныеСостояния.Состояние, Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей, Дата('39991231'));
		ЗаписиВРегистре = Таблица.НайтиСтроки(Отбор);
		
		ЗначениеФлага = ЗначениеФлагаДействия(Действие, ДанныеСостояния, ЭтотОбъект);
		
		Если ЗаписиВРегистре.Количество() = 0 И ЗначениеФлага Тогда
			ЗаписатьДатуЗапретаСОписанием(
			РазделДатыЗапрета, ДанныеСостояния.Состояние, Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей, Дата('39991231'), , );
		КонецЕсли;
		
		Если ЗаписиВРегистре.Количество() <> 0 И Не ЗначениеФлага Тогда
			Запись = РегистрыСведений.ДатыЗапретаИзменения.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, ЗаписиВРегистре[0]);
			Запись.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДатуЗапретаСОписанием(Знач Раздел, Знач Объект, Знач Пользователь, Знач ДатаЗапрета, Знач ВнутреннееОписаниеДатыЗапрета, Знач Комментарий)
	
	Если Не ЗначениеЗаполнено(ДатаЗапрета) Тогда
		ДатаЗапрета = '39991231';
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ДатыЗапретаИзменения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Раздел = Раздел;
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.ДатаЗапрета = ДатаЗапрета;
	МенеджерЗаписи.ОписаниеДатыЗапрета = ВнутреннееОписаниеДатыЗапрета;
	МенеджерЗаписи.Комментарий = Комментарий;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОбязательностиЗаполнения()
	
	Если НЕ ИзмененыНастройкиОбязательностиЗаполнения Тогда
		Возврат;
	КонецЕсли;
	
	ПроцессыВида = ПроцессыВида("ОбработкаПроверкиЗаполнения");
	Если ПроцессыВида.Количество() = 0 Тогда
		ПроцессыВидаОбъект = Справочники.ПроцессыСостоянийЗаказов.СоздатьЭлемент();
		ПроцессыВидаОбъект.Предмет = "ЗаказПоставщику";
	Иначе
		ПроцессыВидаОбъект = ПроцессыВида[0].Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	СтрокиПричиныОтмены = ПроцессыВидаОбъект.ОбработкаПроверкиЗаполнения.НайтиСтроки(Новый Структура("ИмяРеквизита", "ОтмененныеЗапасы.ПричинаОтмены"));
	Для Каждого Строка Из СтрокиПричиныОтмены Цикл
		ПроцессыВидаОбъект.ОбработкаПроверкиЗаполнения.Удалить(Строка);
	КонецЦикла;
	
	Действие = ДействиеПоТипуНастройки("ОбязательноЗаполнятьПолеПричинаОтменыТовара", ЭтотОбъект);
	
	Для Каждого ДанныеСостояния Из ПорядокСостояний Цикл
		
		Если ДанныеСостояния.Состояние = Справочники.СостоянияЗаказовПоставщикам.Завершен Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не Действие[ИмяРеквизитаКолонкиСостояния(, ДанныеСостояния.НомерСтроки, ЭтотОбъект)] Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьНастройкуОбязательностиЗаполнения(ПроцессыВидаОбъект, ДанныеСостояния.Состояние);
		
	КонецЦикла;
	
	Если Действие.ИспользуетсяДляСостояния_ЗавершенУспешно Тогда
		ДобавитьНастройкуОбязательностиЗаполнения(
		ПроцессыВидаОбъект, Справочники.СостоянияЗаказовПоставщикам.Завершен, Перечисления.ВариантыЗавершенияЗаказа.Успешно);
	КонецЕсли;
	Если Действие.ИспользуетсяДляСостояния_ЗавершенОтменен Тогда
		ДобавитьНастройкуОбязательностиЗаполнения(
		ПроцессыВидаОбъект, Справочники.СостоянияЗаказовПоставщикам.Завершен, Перечисления.ВариантыЗавершенияЗаказа.Отменен);
	КонецЕсли;
	
	ПроцессыВидаОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНастройкуОбязательностиЗаполнения(ПроцессыВидаОбъект, Состояние, ВариантЗавершения = Неопределено)
	
	НоваяПроверка = ПроцессыВидаОбъект.ОбработкаПроверкиЗаполнения.Добавить();
	НоваяПроверка.ИмяРеквизита = "ОтмененныеЗапасы.ПричинаОтмены";
	НоваяПроверка.Состояние = Состояние;
	
	Если ВариантЗавершения <> Неопределено Тогда
		НоваяПроверка.ВариантЗавершения = ВариантЗавершения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеЗапретаЗавершения()
	
	Если НЕ ИзмененыНастройкиЗапретаЗавершения Тогда
		Возврат;
	КонецЕсли;
	
	ПроцессыВида = ПроцессыВида("ОбработкаПроведения");
	Если ПроцессыВида.Количество() = 0 Тогда
		ПроцессыВидаОбъект = Справочники.ПроцессыСостоянийЗаказов.СоздатьЭлемент();
		ПроцессыВидаОбъект.Предмет = "ЗаказПоставщику";
	Иначе
		ПроцессыВидаОбъект = ПроцессыВида[0].Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	СтрокиПричиныОтмены = ПроцессыВидаОбъект.ОбработкаПроведения.НайтиСтроки(Новый Структура("Свойство", "ПолностьюОтгружен"));
	Для Каждого Строка Из СтрокиПричиныОтмены Цикл
		ПроцессыВидаОбъект.ОбработкаПроведения.Удалить(Строка);
	КонецЦикла;
	
	Действие = ДействиеПоТипуНастройки("ЗапрещатьЗавершениеНеотгруженныхЗаказов", ЭтотОбъект);
	
	Если Действие.ИспользуетсяДляСостояния_ЗавершенУспешно Тогда
		ДобавитьНастройкуЗапретаЗавершения(
		ПроцессыВидаОбъект, Перечисления.ВариантыЗавершенияЗаказа.Успешно);
	КонецЕсли;
	Если Действие.ИспользуетсяДляСостояния_ЗавершенОтменен Тогда
		ДобавитьНастройкуЗапретаЗавершения(
		ПроцессыВидаОбъект, Перечисления.ВариантыЗавершенияЗаказа.Отменен);
	КонецЕсли;
	
	ПроцессыВидаОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНастройкуЗапретаЗавершения(ПроцессыВидаОбъект, ВариантЗавершения)
	
	НоваяПроверка = ПроцессыВидаОбъект.ОбработкаПроведения.Добавить();
	НоваяПроверка.Свойство = "ПолностьюОтгружен";
	НоваяПроверка.Состояние = Справочники.СостоянияЗаказовПоставщикам.Завершен;
	НоваяПроверка.ВариантЗавершения = ВариантЗавершения;
	
КонецПроцедуры

&НаСервере
Функция ТипОбъектаВерсионирования()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Ссылка КАК ТипОбъекта
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя = ""Документ.ЗаказПоставщику""";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ТипОбъекта;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция РазделДатыЗапрета()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазделыДатыЗапретаИзменений.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.РазделыДатЗапретаИзменения КАК РазделыДатыЗапретаИзменений
	|ГДЕ
	|	РазделыДатыЗапретаИзменений.Наименование = ""Заказы поставщиков""";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьОтветНаВопрос(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		СохранитьДанныеПроцессов();
		Закрыть();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область АссистентУправления

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗадачи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьЗакрытиеФормыЗадачиСервер(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗакрытиеФормыЗадачиСервер(Результат)
	
	ИнформационнаяБазаПодключена = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	АссистентПодключен = АссистентУправления.Подключен();
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьФлагиАссистентУправления(Результат.ГруппаЗадач);
	
	Если НЕ ИнформационнаяБазаПодключена Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ АссистентПодключен Тогда
		Возврат;
	КонецЕсли;
	
	ОбсуждениеСоздано = АссистентУправления.ПолучитьОбсуждениеЖурналРаботыАссистента() <> Неопределено;
	
	Если НЕ ОбсуждениеСоздано Тогда
		Попытка
			СоздатьОбсуждение();
		Исключение
		КонецПопытки;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Результат.АвторИзменений) И Результат.НужноДобавитьВОбсуждение Тогда
		Попытка
			АссистентУправления.ОбновитьУчастниковЖурналРаботыАссистента(Результат.АвторИзменений);
		Исключение
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СоздатьОбсуждение()
	
	Если АссистентУправления.ПолучитьОбсуждениеЖурналРаботыАссистента() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АссистентУправления.СоздатьОбсуждениеЖурналРаботыАссистента();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеМетодыДляБыстройРаботы

&НаКлиентеНаСервереБезКонтекста
Функция ДействиеПоТипуНастройки(ТипНастройки, Форма)
	
	Возврат Форма.Процессы.НайтиСтроки(Новый Структура("ТипНастройки", ТипНастройки))[0];
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НомерСтрокиСостояния(Состояние, Форма)
	
	Состояния = Форма.ПорядокСостояний.НайтиСтроки(Новый Структура("Состояние", Состояние));
	Если Состояния.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Состояния[0].НомерСтроки;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяРеквизитаКолонкиСостояния(Состояние = Неопределено, НомерСтроки = Неопределено, Форма)
	
	Если НомерСтроки = Неопределено Тогда
		
		НомерСтроки = НомерСтрокиСостояния(Состояние, Форма);
		Если НомерСтроки = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрШаблон("ИспользуетсяДляСостояния_%1", НомерСтроки);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагПоДаннымСостояния(Действие, ЗначениеФлага, ДанныеСостояния, Форма)
	
	Если ДанныеСостояния.Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПоставщикам.Завершен") Тогда
		Действие.ИспользуетсяДляСостояния_ЗавершенУспешно = ЗначениеФлага;
		Действие.ИспользуетсяДляСостояния_ЗавершенОтменен = ЗначениеФлага;
		Возврат;
	КонецЕсли;
	
	ИмяРеквизитаКолонкиСостояния = ИмяРеквизитаКолонкиСостояния(ДанныеСостояния.Состояние, ДанныеСостояния.НомерСтроки, Форма);
	Если ИмяРеквизитаКолонкиСостояния = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Действие[ИмяРеквизитаКолонкиСостояния] = ЗначениеФлага;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагПоСостоянию(Действие, ЗначениеФлага, Состояние, Форма)
	
	Если Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПоставщикам.Завершен") Тогда
		Действие.ИспользуетсяДляСостояния_ЗавершенУспешно = ЗначениеФлага;
		Действие.ИспользуетсяДляСостояния_ЗавершенОтменен = ЗначениеФлага;
		Возврат;
	КонецЕсли;
	
	ИмяРеквизитаКолонкиСостояния = ИмяРеквизитаКолонкиСостояния(Состояние, , Форма);
	Если ИмяРеквизитаКолонкиСостояния = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Действие[ИмяРеквизитаКолонкиСостояния] = ЗначениеФлага;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВсеПоследующиеФлаги(Действие, ЗначениеФлага, Форма, ИмяКолонки = Неопределено, Состояние = Неопределено, Включая = Истина)
	
	Если ИмяКолонки = Неопределено Тогда
		
		Если Состояние = Справочники.СостоянияЗаказовПоставщикам.Завершен Тогда
			ИмяКолонки = Элементы.ПроцессыИспользуетсяДляСостояния_ЗавершенУспешно.Имя;
		Иначе
			
			НомерСтроки = НомерСтрокиСостояния(Состояние, ЭтотОбъект);
			Если НомерСтроки = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			ИмяКолонки = "ПроцессыИспользуетсяДляСостояния_" + НомерСтроки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НайденаТекущаяКолонка = Ложь;
	Для Каждого Колонка Из Элементы.Процессы.ПодчиненныеЭлементы Цикл
		
		Если Колонка.Имя = ИмяКолонки Тогда
			НайденаТекущаяКолонка = Истина;
		КонецЕсли;
		
		Если Не НайденаТекущаяКолонка Тогда
			Продолжить;
		КонецЕсли;
		
		Если Колонка.Имя <> ИмяКолонки Или Колонка.Имя = ИмяКолонки И Включая Тогда
			
			НаименованиеПоля = Сред(Колонка.ПутьКДанным, СтрДлина("Процессы.") + 1);
			Действие[НаименованиеПоля] = ЗначениеФлага;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеФлагаДействия(Действие, ДанныеСостояния, Форма)
	
	Если ДанныеСостояния.Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПоставщикам.Завершен") Тогда
		Возврат Действие.ИспользуетсяДляСостояния_ЗавершенУспешно;
	КонецЕсли;
	
	ИмяРеквизитаКолонкиСостояния = ИмяРеквизитаКолонкиСостояния(, ДанныеСостояния.НомерСтроки, Форма);
	Если ИмяРеквизитаКолонкиСостояния = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Действие[ИмяРеквизитаКолонкиСостояния];
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагиДействий(Действия, ЗначениеФлага, Форма)
	
	Если ТипЗнч(Действия) = Тип("Массив") Тогда
		ДействияСписок = Действия;
	Иначе
		ДействияСписок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Действия);
	КонецЕсли;
	
	Для Каждого Действие Из ДействияСписок Цикл
		Для Каждого ДанныеСостояния Из Форма.ПорядокСостояний Цикл
			УстановитьФлагПоДаннымСостояния(Действие, ЗначениеФлага, ДанныеСостояния, Форма);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПроцессыВида(ИмяТаблицы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПроцессов(ИмяТаблицы);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаПроцессов(ИмяТаблицы)
	
	Если ИмяТаблицы = "ОбработкаПроверкиЗаполнения" Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПроцессыСостоянийЗаказов.Ссылка КАК Ссылка,
		|	ПроцессыОбработкаПроверкиЗаполнения.НомерСтроки КАК НомерСтроки,
		|	ПроцессыОбработкаПроверкиЗаполнения.Состояние КАК Состояние,
		|	ПроцессыОбработкаПроверкиЗаполнения.ИмяРеквизита КАК ИмяРеквизита,
		|	ПроцессыОбработкаПроверкиЗаполнения.ВариантЗавершения КАК ВариантЗавершения
		|ИЗ
		|	Справочник.ПроцессыСостоянийЗаказов КАК ПроцессыСостоянийЗаказов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроцессыСостоянийЗаказов.ОбработкаПроверкиЗаполнения КАК ПроцессыОбработкаПроверкиЗаполнения
		|		ПО ПроцессыСостоянийЗаказов.Ссылка = ПроцессыОбработкаПроверкиЗаполнения.Ссылка
		|ГДЕ
		|	ПроцессыСостоянийЗаказов.Предмет = ""ЗаказПоставщику""";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПроцессыСостоянийЗаказов.Ссылка КАК Ссылка,
		|	ПроцессыОбработкаПроведения.НомерСтроки КАК НомерСтроки,
		|	ПроцессыОбработкаПроведения.Состояние КАК Состояние,
		|	ПроцессыОбработкаПроведения.ВариантЗавершения КАК ВариантЗавершения,
		|	ПроцессыОбработкаПроведения.Свойство КАК Свойство
		|ИЗ
		|	Справочник.ПроцессыСостоянийЗаказов КАК ПроцессыСостоянийЗаказов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроцессыСостоянийЗаказов.ОбработкаПроведения КАК ПроцессыОбработкаПроведения
		|		ПО ПроцессыСостоянийЗаказов.Ссылка = ПроцессыОбработкаПроведения.Ссылка
		|ГДЕ
		|	ПроцессыСостоянийЗаказов.Предмет = ""ЗаказПоставщику""";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыСостояний.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	Элементы.СтраницаПроцессы.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере()
	
	ОбновитьПроцессы();
	УстановитьУсловноеОформлениеПоЦветамСостоянийСервер();
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаКолонки.Группировка = ГруппировкаКолонок.ВЯчейке;
	
КонецПроцедуры

#КонецОбласти
